In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.read_csv(r'C:\Users\KARAN\Downloads\DSML_PRACTICAL\DSML_PRACTICAL\Datasets\Titanic.csv')

In [15]:
print(df.head())

   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

In [16]:
print(df.sample())

     PassengerId  Survived  Pclass                     Name   Sex   Age  \
372         1264         0       1  Ismay, Mr. Joseph Bruce  male  49.0

     SibSp  Parch  Ticket  Fare        Cabin Embarked
372      0      0  112058   0.0  B52 B54 B56        S

In [17]:
## Indexing and Selecting Data

print("setting passengerID as Index")
df.set_index("PassengerId", inplace=True)

df.head()

setting passengerID as Index

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [18]:
print("selecting a specific column")
print(df["Name"].head())

selecting a specific column
PassengerId
892                                Kelly, Mr. James
893                Wilkes, Mrs. James (Ellen Needs)
894                       Myles, Mr. Thomas Francis
895                                Wirz, Mr. Albert
896    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Name: Name, dtype: object

In [20]:
print("Selecting rows using loc (label based)")
print(df.loc[1:5, ["Name", "Survived"]])

Selecting rows using loc (label based)
Empty DataFrame
Columns: [Name, Survived]
Index: []

In [21]:
print("Selecting rows using iloc (position based)")
print(df.iloc[0:5,0:3])

Selecting rows using iloc (position based)
             Survived  Pclass                                          Name
PassengerId
892                 0       3                              Kelly, Mr. James
893                 1       3              Wilkes, Mrs. James (Ellen Needs)
894                 0       2                     Myles, Mr. Thomas Francis
895                 0       3                              Wirz, Mr. Albert
896                 1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

In [22]:
# Sort Data
print("Sorting data by age")
sorted_data = df.sort_values(by="Age", ascending=True)
print(sorted_data.head())

Sorting data by age
             Survived  Pclass                                     Name  \
PassengerId
1246                1       3  Dean, Miss. Elizabeth Gladys Millvina""
1093                0       3  Danbom, Master. Gilbert Sigvard Emanuel
1173                0       3           Peacock, Master. Alfred Edward
1199                0       3                Aks, Master. Philip Frank
1142                1       2                    West, Miss. Barbara J

                Sex   Age  SibSp  Parch              Ticket    Fare Cabin  \
PassengerId
1246         female  0.17      1      2           C.A. 2315  20.575   NaN
1093           male  0.33      0      2              347080  14.400   NaN
1173           male  0.75      1      1  SOTON/O.Q. 3101315  13.775   NaN
1199           male  0.83      0      1              392091   9.350   NaN
1142         female  0.92      1      2          C.A. 34651  27.750   NaN

            Embarked
PassengerId
1246               S
1093               S
1173               S
1199               S
1142               S

In [23]:
## Describing numerical attributes
print(df.describe())

         Survived      Pclass         Age       SibSp       Parch        Fare
count  418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean     0.363636    2.265550   30.272590    0.447368    0.392344   35.627188
std      0.481622    0.841838   14.181209    0.896760    0.981429   55.907576
min      0.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   21.000000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   27.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   39.000000    1.000000    0.000000   31.500000
max      1.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [24]:
## Describing all attributes, including categorical
print(df.describe(include="all"))

          Survived      Pclass                      Name   Sex         Age  \
count   418.000000  418.000000                       418   418  332.000000
unique         NaN         NaN                       418     2         NaN
top            NaN         NaN  Peter, Master. Michael J  male         NaN
freq           NaN         NaN                         1   266         NaN
mean      0.363636    2.265550                       NaN   NaN   30.272590
std       0.481622    0.841838                       NaN   NaN   14.181209
min       0.000000    1.000000                       NaN   NaN    0.170000
25%       0.000000    1.000000                       NaN   NaN   21.000000
50%       0.000000    3.000000                       NaN   NaN   27.000000
75%       1.000000    3.000000                       NaN   NaN   39.000000
max       1.000000    3.000000                       NaN   NaN   76.000000

             SibSp       Parch    Ticket        Fare            Cabin Embarked
count   418.000000  418.000000       418  417.000000               91      418
unique         NaN         NaN       363         NaN               76        3
top            NaN         NaN  PC 17608         NaN  B57 B59 B63 B66        S
freq           NaN         NaN         5         NaN                3      270
mean      0.447368    0.392344       NaN   35.627188              NaN      NaN
std       0.896760    0.981429       NaN   55.907576              NaN      NaN
min       0.000000    0.000000       NaN    0.000000              NaN      NaN
25%       0.000000    0.000000       NaN    7.895800              NaN      NaN
50%       0.000000    0.000000       NaN   14.454200              NaN      NaN
75%       1.000000    0.000000       NaN   31.500000              NaN      NaN
max       8.000000    9.000000       NaN  512.329200              NaN      NaN

In [25]:
## Checking dataset structure and memory usage
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 418 entries, 892 to 1309
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  418 non-null    int64
 1   Pclass    418 non-null    int64
 2   Name      418 non-null    object
 3   Sex       418 non-null    object
 4   Age       332 non-null    float64
 5   SibSp     418 non-null    int64
 6   Parch     418 non-null    int64
 7   Ticket    418 non-null    object
 8   Fare      417 non-null    float64
 9   Cabin     91 non-null     object
 10  Embarked  418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 55.4+ KB
None

In [26]:
## Displaying data types of all columns
print(df.dtypes)

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object